### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app.aws_route53_zone.design_vy_no will be destroyed
  # (because aws_route53_zone.design_vy_no is not in configuration)
  - resource "aws_route53_zone" "design_vy_no" {
      - arn                 = "arn:aws:route53:::hostedzone/Z00021212ZRY1BOSB4G92" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z00021212ZRY1BOSB4G92" -> null
      - name                = "test.design.vy.no" -> null
      - name_servers        = [
          - "ns-1057.awsdns-04.org",
          - "ns-161.awsdns-20.com",
          - "ns-2035.awsdns-62.co.uk",
          - "ns-862.awsdns-43.net",
        ] -> null
      - primary_name_server = "ns-2035.awsdns-62.co.uk" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - zone_id             = "Z00021212ZRY1BOSB4G92" -> null
        # (1 unchanged attribute hidden)
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:590183702222:certificate/4deea3b6-e4be-4112-b330-f07ebd3dadea" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "test.design.vy.no"
              - resource_record_name  = "_e7b55039e0702e531407d3f2bff9ab72.test.design.vy.no."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6d9377fc088d0f45d75a01cd87f1cdbb.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "*.designmanual.test.vylabs.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "designmanual.test.vylabs.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:590183702222:certificate/4deea3b6-e4be-4112-b330-f07ebd3dadea" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-11-14T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-10-16T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "INELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "test.design.vy.no",
            # (2 unchanged elements hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront (deposed object 4de5f703) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_acm_certificate" "cloudfront" {
      - arn                       = "arn:aws:acm:us-east-1:590183702222:certificate/76e2a1dd-be42-4905-9a87-9eeba906536c" -> null
      - domain_name               = "designmanual.test.vylabs.io" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "designmanual.test.vylabs.io"
              - resource_record_name  = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:590183702222:certificate/76e2a1dd-be42-4905-9a87-9eeba906536c" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2026-11-14T23:59:59Z" -> null
      - not_before                = "2025-10-16T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - region                    = "us-east-1" -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "*.designmanual.test.vylabs.io",
          - "designmanual.test.vylabs.io",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate_validation.cloudfront will be created
  + resource "aws_acm_certificate_validation" "cloudfront" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + region                  = "us-east-1"
      + validation_record_fqdns = (known after apply)

      + timeouts {
          + create = "45m"
        }
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E2X66A4CTR5YKV"
        tags                            = {}
        # (24 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:590183702222:certificate/76e2a1dd-be42-4905-9a87-9eeba906536c" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["*.designmanual.test.vylabs.io"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply)
      ~ id                               = "Z040766361YOSZ9Z30XK__4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["designmanual.test.vylabs.io"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply)
      ~ id                               = "Z040766361YOSZ9Z30XK__4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_4022db1f1cdde5508bdee585bc2fdaf5.designmanual.test.vylabs.io" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_28f38bc889c9967004e8fbc8c1aaa920.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["test.design.vy.no"] will be destroyed
  # (because key ["test.design.vy.no"] is not in for_each map)
  - resource "aws_route53_record" "cert_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_e7b55039e0702e531407d3f2bff9ab72.test.design.vy.no.test.vylabs.io" -> null
      - id                               = "Z040766361YOSZ9Z30XK__e7b55039e0702e531407d3f2bff9ab72.test.design.vy.no._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_e7b55039e0702e531407d3f2bff9ab72.test.design.vy.no" -> null
      - records                          = [
          - "_6d9377fc088d0f45d75a01cd87f1cdbb.xlfgrmvvlj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z040766361YOSZ9Z30XK" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 6 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 748f141edc76be0befa9bdff4aa48084fa14d93b*
*Plan generated at: 2025-10-17 08:55:57 UTC*
